<script setup>
const dataFirst = {
  title: 'Затраты',
  cost: '1 000 000, 00 ₽',
  correlation: {
    title: 'Корреляция между финансовой ситуацией и сезонностью',
    value: '0,86',
  },
  analysis: {
    title: 'Анализ сезонности',
    value: 'Общий спрос по рынку на товары категории «Спорт и отдых» вырос в апреле на 36% по сравнению с прошлым месяцем. Наибольшую прибыль вам приносят товары: «Палатка» и «Термос», количество продаж выросло на 48% по сравнению с прошлым месяцем.'
  },
  season: [
    {
      title: 'Увеличить цветовую палитру термосов',
      description: 'Увеличение ... на , ... на n% m% Увеличение ... на , ... на n% m%',
    },
    {
      title: 'Увеличить цветовую палитру термосов',
      description: 'Увеличение ... на , ... на n% m%',
    },
    {
      title: 'Увеличить цветовую палитру термосов',
      description: 'Увеличение ... на , ... на n% m%',
    },
    {
      title: 'Увеличить цветовую палитру термосов',
      description: 'Увеличение ... на , ... на n% m% Увеличение ... на , ... на n% m%',
    }
  ],
  graph: {
    data: [40000, 39000, 10000, 40000, 39000, 80000, 40000],
    labels: ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль']
  }
}

const dataSecond = {
  title: 'Затраты',
  cost: '2 000 000, 00 ₽',
  analysis: {
    title: 'Анализ затрат',
    value: 'Применение новых льгот для малого бизнеса сократило фискальную нагрузку на 12%. Обновленная маркетинговая стратегия и переход на таргетированную рекламу снизил стоимость привлечения клиента на 18%. Оптимизация логистики и переговоры с перевозчиками уменьшили затраты на доставку на 7%.'
  },
  season: [
    {
      title: 'Смена контрагентов',
      description: 'Применение новых льгот для малого бизнеса сократило фискальную нагрузку на 12%. Обновленная маркетинговая стратегия и переход на таргетированную рекламу снизил стоимость привлечения клиента на 18%. Оптимизация логистики и переговоры с перевозчиками уменьшили затраты на доставку на 7%.',
    },
    {
      title: 'Упрощение устройства палаток Упрощение устройства палаток',
      description: 'Увеличение ... на , ... на n% m%',
    },
    {
      title: 'Смена контрагентов',
      description: 'Увеличение ... на , ... на n% m% Увеличение ... на , ... на n% m%',
    },
    {
      title: 'Упрощение устройства палаток',
      description: 'Увеличение ... на , ... на n% m%',
    }
  ],
  graph: {
    data: [10000, 59000, 40000, 70000, 29000, 40000, 10000],
    labels: ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль']
  }
}
</script>

<template>
  <div class="analytics">
    <ElementsUpload />
    <div class="block">
      <BlockRight :cost="dataFirst.cost"
                  :title="dataFirst.title"
                  :graph="dataFirst.graph"/>
      <BlockLeft
          :analysis="dataFirst.analysis"
          :corr="dataFirst.correlation"
          :season="dataFirst.season"
      />
    </div>
    <div class="block">
      <BlockRight :cost="dataSecond.cost"
                  :title="dataSecond.title"
                  :graph="dataSecond.graph"/>
      <BlockLeft
          :analysis="dataSecond.analysis"
          :season="dataSecond.season"
      />
    </div>
  </div>
</template>

<style lang="sass">
.analytics
  display: flex
  flex-direction: column
  gap: 25px
</style>