<script setup>
import {Swiper, SwiperSlide} from 'swiper/vue';
import 'swiper/css';

const swiper = ref(null);

const billsData = [
  {
    title: 'Все счета',
    value: '1 000 000, 00 ₽',
  },
  {
    title: 'Накопительный',
    value: '320 378, 32 ₽',
  },
  {
    title: 'Расчетный',
    value: '320 378, 32 ₽',
  },
  {
    title: 'Текущий',
    value: '320 378, 32 ₽',
  },
  {
    title: 'Бюджетный',
    value: '320 378, 32 ₽',
  },
]
const taxData = [
  {
    title: 'Порядок заполнения декларации по налогу на прибыль организаций: посмотрите, как правильно заполнить декларацию.',
    description: 'В этой статье:\n' +
        'Порядок заполнения\n' +
        'Титульный лист\n' +
        'Раздел 1\n' +
        'Лист 02\n' +
        'Приложение № 1 к листу 02\n' +
        'Приложение № 2 к листу 02\n' +
        'Налог на прибыль рассчитывают все организации на ОСНО. Кодекс предусматривает два типа отчетных периодов (ст. 285 НК РФ), т. е. периодичность представления декларации по налогу на прибыль: раз в месяц и раз в квартал.\n' +
        'Налог на прибыль рассчитывается нарастающим итогом с начала года. Если компания отчитывается раз в квартал, то декларации нужно представлять по итогам I квартала, полугодия, 9 месяцев и года. Соответственно, в 2025 году отчетными датами будут: 25.03.2025 (за 2024 год), 25.04.2025, 25.07.2025, 25.10.2025. А за 2025 год нужно будет отчитаться до 25.03.2026.\n' +
        'Организации, которые рассчитывают налог по фактической прибыли каждый месяц, ежемесячно сдают декларации не позднее 25-го числа каждого месяца.\n' +
        'Если крайний срок сдачи декларации выпадает на выходной или праздничный день, отчитаться нужно будет на следующий за ним рабочий день. Например, декларацию за июль — сентябрь 2025 года нужно сдать не позднее 27 октября, так как 25 октября 2025 года — это суббота.\n' +
        'Небольшие компании со среднесписочной численностью работников до 100 человек могут сдать декларацию на бумаге, остальным придется отчитаться в электронном формате (п. 3 ст. 80 НК РФ).\n' +
        'Порядок заполнения\n' +
        'Согласно Порядку заполнения налогоплательщики обязательно представляют в составе декларации следующие листы:\n' +
        'титульный лист (лист 01);\n' +
        'подраздел 1.1 раздела 1;\n' +
        'лист 02;\n' +
        'приложения № 1 и № 2 к листу 02.\n' +
        'Остальные листы и приложения заполняются при наличии определенных показателей.\n' +
        'Рассмотрим заполнение обязательных разделов.\n' +
        'Титульный лист\n' +
        'Заполняются все данные об отчитывающейся организации.\n' +
        'Смотреть подробное описание\n' +
        'Раздел 1\n' +
        'Сумму налога, которую нужно заплатить в бюджет, отражают в разделе 1.\n' +
        'Подраздел 1.1 заполняется в обязательном порядке. Здесь показываются суммы налога на прибыль и авансовых платежей, подлежащих уплате за отчетный период. Данные берутся из строк 270–281 листа 02 декларации. Налог к доплате или к уменьшению показывается с учетом авансовых платежей.\n' +
        'Если компания в I квартале в федеральный бюджет заплатила 5 000 рублей, а налог на прибыль в этот бюджет за полугодие равен 8 000 рублей, по итогам полугодия нужно доплатить 3 000 рублей (8 000 — 5 000). То есть по строке 040 подраздела 1.1 нужно указать сумму 3 000 рублей.\n' +
        'Подраздел 1.2 подлежит заполнению организациями, уплачивающими авансовые платежи каждый месяц исходя из прибыли за предыдущий квартал или фактической прибыли. В годовой декларации этого раздела быть не должно.\n' +
        'По строкам 120–140 и 220–240 отражается третья часть сумм, указанных по строкам 300–310 и 330–340 листа 02.\n' +
        'Если компания платит налог на прибыль с процентов и дивидендов, заполняется подраздел 1.3.\n' +
        'Лист 02\n' +
        'Налоговая база определяется как разница между доходами и расходами организации, которые находят свое отражение в листе 02 налоговой декларации.\n' +
        'Подробная расшифровка доходов и расходов отражается в приложениях к листу 02. В самом же листе показываются общие суммы доходов и расходов, налоговая база и исчисленный налог.\n' +
        'В строке 110 отражаются убытки прошлых лет, перенесенные на текущий период.\n' +
        'Ставка налога на прибыль (строки 150–170) с 2025 года повысилась на 5% и составляет 25%. До 2030 года она распределяется следующим образом: 8% — федеральный бюджет, 17 % — бюджеты субъектов РФ (ст. 284 НК РФ).\n' +
        'В 2024 году действовало другое распределение: 3% — федеральный бюджет, 17% — бюджеты субъектов РФ.\n' +
        'Смотреть подробное заполнение листа 02\n' +
        'Приложение № 1 к листу 02\n' +
        'В данном приложении отражаются все доходы по данным налогового учета, включая внереализационные.\n' +
        'Итоговая сумма полученных доходов записывается в строку 040, которая затем дублируется в строке 010 листа 02.\n' +
        'Внереализационные доходы отражаются отдельно от доходов с продажи товаров или услуг (работ). При этом некоторые виды внереализационных доходов выделяются в отдельные строчки, например доходы в виде безвозмездно полученного имущества (строка 103).\n' +
        'Смотреть детальное заполнение приложения № 1\n' +
        'Сдайте декларацию по налогу на прибыль бесплатно через Экстерн в рамках «Тест-драйва»!\n' +
        'Приложение № 2 к листу 02\n' +
        'Данное приложение содержит информацию о расходах компании, в том числе о внереализационных.\n' +
        'Условно расходы, которые присутствуют в деятельности почти любого предприятия, можно разделить на три блока:\n' +
        'прямые расходы (строки 010–030);\n' +
        'косвенные расходы (строки 040–055);\n' +
        'внереализационные расходы (строки 200–206).\n' +
        'Если организация работает по кассовому методу, строки 010–030 не заполняются.\n' +
        'Отдельными строками отражаются расходы, касающиеся оборота ценных бумаг, имущественных прав и т.д.\n' +
        'Суммы убытков показываются в строках 090–100 приложения № 2.\n' +
        'Отдельно выделяется сумма амортизации, начисленной линейным и нелинейным методом (строки 131 — 134). При этом амортизация нематериальных активов выделяет отдельными строками. В строке 135 указывается код выбранного метода.\n' +
        'В строке 205 показывают суммы штрафных санкций и пени за неисполнение условий договоров.\n' +
        'Обратите внимание, что штрафы контролирующих органов за нарушение учета или несвоевременную уплату налогов в строке 205 не отражаются.\n',
  },
  {
    title: 'С 30 февраля 2030 года страховые взносы составят всего 8,6%',
    description: 'В этой статье:\n' +
        'Порядок заполнения\n' +
        'Титульный лист\n' +
        'Раздел 1\n' +
        'Лист 02\n' +
        'Приложение № 1 к листу 02\n' +
        'Приложение № 2 к листу 02\n' +
        'Налог на прибыль рассчитывают все организации на ОСНО. Кодекс предусматривает два типа отчетных периодов (ст. 285 НК РФ), т. е. периодичность представления декларации по налогу на прибыль: раз в месяц и раз в квартал.\n' +
        'Налог на прибыль рассчитывается нарастающим итогом с начала года. Если компания отчитывается раз в квартал, то декларации нужно представлять по итогам I квартала, полугодия, 9 месяцев и года. Соответственно, в 2025 году отчетными датами будут: 25.03.2025 (за 2024 год), 25.04.2025, 25.07.2025, 25.10.2025. А за 2025 год нужно будет отчитаться до 25.03.2026.\n' +
        'Организации, которые рассчитывают налог по фактической прибыли каждый месяц, ежемесячно сдают декларации не позднее 25-го числа каждого месяца.\n' +
        'Если крайний срок сдачи декларации выпадает на выходной или праздничный день, отчитаться нужно будет на следующий за ним рабочий день. Например, декларацию за июль — сентябрь 2025 года нужно сдать не позднее 27 октября, так как 25 октября 2025 года — это суббота.\n' +
        'Небольшие компании со среднесписочной численностью работников до 100 человек могут сдать декларацию на бумаге, остальным придется отчитаться в электронном формате (п. 3 ст. 80 НК РФ).\n' +
        'Порядок заполнения\n' +
        'Согласно Порядку заполнения налогоплательщики обязательно представляют в составе декларации следующие листы:\n' +
        'титульный лист (лист 01);\n' +
        'подраздел 1.1 раздела 1;\n' +
        'лист 02;\n' +
        'приложения № 1 и № 2 к листу 02.\n' +
        'Остальные листы и приложения заполняются при наличии определенных показателей.\n' +
        'Рассмотрим заполнение обязательных разделов.\n' +
        'Титульный лист\n' +
        'Заполняются все данные об отчитывающейся организации.\n' +
        'Смотреть подробное описание\n' +
        'Раздел 1\n' +
        'Сумму налога, которую нужно заплатить в бюджет, отражают в разделе 1.\n' +
        'Подраздел 1.1 заполняется в обязательном порядке. Здесь показываются суммы налога на прибыль и авансовых платежей, подлежащих уплате за отчетный период. Данные берутся из строк 270–281 листа 02 декларации. Налог к доплате или к уменьшению показывается с учетом авансовых платежей.\n' +
        'Если компания в I квартале в федеральный бюджет заплатила 5 000 рублей, а налог на прибыль в этот бюджет за полугодие равен 8 000 рублей, по итогам полугодия нужно доплатить 3 000 рублей (8 000 — 5 000). То есть по строке 040 подраздела 1.1 нужно указать сумму 3 000 рублей.\n' +
        'Подраздел 1.2 подлежит заполнению организациями, уплачивающими авансовые платежи каждый месяц исходя из прибыли за предыдущий квартал или фактической прибыли. В годовой декларации этого раздела быть не должно.\n' +
        'По строкам 120–140 и 220–240 отражается третья часть сумм, указанных по строкам 300–310 и 330–340 листа 02.\n' +
        'Если компания платит налог на прибыль с процентов и дивидендов, заполняется подраздел 1.3.\n' +
        'Лист 02\n' +
        'Налоговая база определяется как разница между доходами и расходами организации, которые находят свое отражение в листе 02 налоговой декларации.\n' +
        'Подробная расшифровка доходов и расходов отражается в приложениях к листу 02. В самом же листе показываются общие суммы доходов и расходов, налоговая база и исчисленный налог.\n' +
        'В строке 110 отражаются убытки прошлых лет, перенесенные на текущий период.\n' +
        'Ставка налога на прибыль (строки 150–170) с 2025 года повысилась на 5% и составляет 25%. До 2030 года она распределяется следующим образом: 8% — федеральный бюджет, 17 % — бюджеты субъектов РФ (ст. 284 НК РФ).\n' +
        'В 2024 году действовало другое распределение: 3% — федеральный бюджет, 17% — бюджеты субъектов РФ.\n' +
        'Смотреть подробное заполнение листа 02\n' +
        'Приложение № 1 к листу 02\n' +
        'В данном приложении отражаются все доходы по данным налогового учета, включая внереализационные.\n' +
        'Итоговая сумма полученных доходов записывается в строку 040, которая затем дублируется в строке 010 листа 02.\n' +
        'Внереализационные доходы отражаются отдельно от доходов с продажи товаров или услуг (работ). При этом некоторые виды внереализационных доходов выделяются в отдельные строчки, например доходы в виде безвозмездно полученного имущества (строка 103).\n' +
        'Смотреть детальное заполнение приложения № 1\n' +
        'Сдайте декларацию по налогу на прибыль бесплатно через Экстерн в рамках «Тест-драйва»!\n' +
        'Приложение № 2 к листу 02\n' +
        'Данное приложение содержит информацию о расходах компании, в том числе о внереализационных.\n' +
        'Условно расходы, которые присутствуют в деятельности почти любого предприятия, можно разделить на три блока:\n' +
        'прямые расходы (строки 010–030);\n' +
        'косвенные расходы (строки 040–055);\n' +
        'внереализационные расходы (строки 200–206).\n' +
        'Если организация работает по кассовому методу, строки 010–030 не заполняются.\n' +
        'Отдельными строками отражаются расходы, касающиеся оборота ценных бумаг, имущественных прав и т.д.\n' +
        'Суммы убытков показываются в строках 090–100 приложения № 2.\n' +
        'Отдельно выделяется сумма амортизации, начисленной линейным и нелинейным методом (строки 131 — 134). При этом амортизация нематериальных активов выделяет отдельными строками. В строке 135 указывается код выбранного метода.\n' +
        'В строке 205 показывают суммы штрафных санкций и пени за неисполнение условий договоров.\n' +
        'Обратите внимание, что штрафы контролирующих органов за нарушение учета или несвоевременную уплату налогов в строке 205 не отражаются.\n',
  },
  {
    title: 'Порядок заполнения декларации по налогу на прибыль организаций: посмотрите, как правильно заполнить декларацию.',
    description: 'В этой статье:\n' +
        'Порядок заполнения\n' +
        'Титульный лист\n' +
        'Раздел 1\n' +
        'Лист 02\n' +
        'Приложение № 1 к листу 02\n' +
        'Приложение № 2 к листу 02\n' +
        'Налог на прибыль рассчитывают все организации на ОСНО. Кодекс предусматривает два типа отчетных периодов (ст. 285 НК РФ), т. е. периодичность представления декларации по налогу на прибыль: раз в месяц и раз в квартал.\n' +
        'Налог на прибыль рассчитывается нарастающим итогом с начала года. Если компания отчитывается раз в квартал, то декларации нужно представлять по итогам I квартала, полугодия, 9 месяцев и года. Соответственно, в 2025 году отчетными датами будут: 25.03.2025 (за 2024 год), 25.04.2025, 25.07.2025, 25.10.2025. А за 2025 год нужно будет отчитаться до 25.03.2026.\n' +
        'Организации, которые рассчитывают налог по фактической прибыли каждый месяц, ежемесячно сдают декларации не позднее 25-го числа каждого месяца.\n' +
        'Если крайний срок сдачи декларации выпадает на выходной или праздничный день, отчитаться нужно будет на следующий за ним рабочий день. Например, декларацию за июль — сентябрь 2025 года нужно сдать не позднее 27 октября, так как 25 октября 2025 года — это суббота.\n' +
        'Небольшие компании со среднесписочной численностью работников до 100 человек могут сдать декларацию на бумаге, остальным придется отчитаться в электронном формате (п. 3 ст. 80 НК РФ).\n' +
        'Порядок заполнения\n' +
        'Согласно Порядку заполнения налогоплательщики обязательно представляют в составе декларации следующие листы:\n' +
        'титульный лист (лист 01);\n' +
        'подраздел 1.1 раздела 1;\n' +
        'лист 02;\n' +
        'приложения № 1 и № 2 к листу 02.\n' +
        'Остальные листы и приложения заполняются при наличии определенных показателей.\n' +
        'Рассмотрим заполнение обязательных разделов.\n' +
        'Титульный лист\n' +
        'Заполняются все данные об отчитывающейся организации.\n' +
        'Смотреть подробное описание\n' +
        'Раздел 1\n' +
        'Сумму налога, которую нужно заплатить в бюджет, отражают в разделе 1.\n' +
        'Подраздел 1.1 заполняется в обязательном порядке. Здесь показываются суммы налога на прибыль и авансовых платежей, подлежащих уплате за отчетный период. Данные берутся из строк 270–281 листа 02 декларации. Налог к доплате или к уменьшению показывается с учетом авансовых платежей.\n' +
        'Если компания в I квартале в федеральный бюджет заплатила 5 000 рублей, а налог на прибыль в этот бюджет за полугодие равен 8 000 рублей, по итогам полугодия нужно доплатить 3 000 рублей (8 000 — 5 000). То есть по строке 040 подраздела 1.1 нужно указать сумму 3 000 рублей.\n' +
        'Подраздел 1.2 подлежит заполнению организациями, уплачивающими авансовые платежи каждый месяц исходя из прибыли за предыдущий квартал или фактической прибыли. В годовой декларации этого раздела быть не должно.\n' +
        'По строкам 120–140 и 220–240 отражается третья часть сумм, указанных по строкам 300–310 и 330–340 листа 02.\n' +
        'Если компания платит налог на прибыль с процентов и дивидендов, заполняется подраздел 1.3.\n' +
        'Лист 02\n' +
        'Налоговая база определяется как разница между доходами и расходами организации, которые находят свое отражение в листе 02 налоговой декларации.\n' +
        'Подробная расшифровка доходов и расходов отражается в приложениях к листу 02. В самом же листе показываются общие суммы доходов и расходов, налоговая база и исчисленный налог.\n' +
        'В строке 110 отражаются убытки прошлых лет, перенесенные на текущий период.\n' +
        'Ставка налога на прибыль (строки 150–170) с 2025 года повысилась на 5% и составляет 25%. До 2030 года она распределяется следующим образом: 8% — федеральный бюджет, 17 % — бюджеты субъектов РФ (ст. 284 НК РФ).\n' +
        'В 2024 году действовало другое распределение: 3% — федеральный бюджет, 17% — бюджеты субъектов РФ.\n' +
        'Смотреть подробное заполнение листа 02\n' +
        'Приложение № 1 к листу 02\n' +
        'В данном приложении отражаются все доходы по данным налогового учета, включая внереализационные.\n' +
        'Итоговая сумма полученных доходов записывается в строку 040, которая затем дублируется в строке 010 листа 02.\n' +
        'Внереализационные доходы отражаются отдельно от доходов с продажи товаров или услуг (работ). При этом некоторые виды внереализационных доходов выделяются в отдельные строчки, например доходы в виде безвозмездно полученного имущества (строка 103).\n' +
        'Смотреть детальное заполнение приложения № 1\n' +
        'Сдайте декларацию по налогу на прибыль бесплатно через Экстерн в рамках «Тест-драйва»!\n' +
        'Приложение № 2 к листу 02\n' +
        'Данное приложение содержит информацию о расходах компании, в том числе о внереализационных.\n' +
        'Условно расходы, которые присутствуют в деятельности почти любого предприятия, можно разделить на три блока:\n' +
        'прямые расходы (строки 010–030);\n' +
        'косвенные расходы (строки 040–055);\n' +
        'внереализационные расходы (строки 200–206).\n' +
        'Если организация работает по кассовому методу, строки 010–030 не заполняются.\n' +
        'Отдельными строками отражаются расходы, касающиеся оборота ценных бумаг, имущественных прав и т.д.\n' +
        'Суммы убытков показываются в строках 090–100 приложения № 2.\n' +
        'Отдельно выделяется сумма амортизации, начисленной линейным и нелинейным методом (строки 131 — 134). При этом амортизация нематериальных активов выделяет отдельными строками. В строке 135 указывается код выбранного метода.\n' +
        'В строке 205 показывают суммы штрафных санкций и пени за неисполнение условий договоров.\n' +
        'Обратите внимание, что штрафы контролирующих органов за нарушение учета или несвоевременную уплату налогов в строке 205 не отражаются.\n',
  },
  {
    title: 'С 30 февраля 2030 года страховые взносы составят всего 8,6%',
    description: 'В этой статье:\n' +
        'Порядок заполнения\n' +
        'Титульный лист\n' +
        'Раздел 1\n' +
        'Лист 02\n' +
        'Приложение № 1 к листу 02\n' +
        'Приложение № 2 к листу 02\n' +
        'Налог на прибыль рассчитывают все организации на ОСНО. Кодекс предусматривает два типа отчетных периодов (ст. 285 НК РФ), т. е. периодичность представления декларации по налогу на прибыль: раз в месяц и раз в квартал.\n' +
        'Налог на прибыль рассчитывается нарастающим итогом с начала года. Если компания отчитывается раз в квартал, то декларации нужно представлять по итогам I квартала, полугодия, 9 месяцев и года. Соответственно, в 2025 году отчетными датами будут: 25.03.2025 (за 2024 год), 25.04.2025, 25.07.2025, 25.10.2025. А за 2025 год нужно будет отчитаться до 25.03.2026.\n' +
        'Организации, которые рассчитывают налог по фактической прибыли каждый месяц, ежемесячно сдают декларации не позднее 25-го числа каждого месяца.\n' +
        'Если крайний срок сдачи декларации выпадает на выходной или праздничный день, отчитаться нужно будет на следующий за ним рабочий день. Например, декларацию за июль — сентябрь 2025 года нужно сдать не позднее 27 октября, так как 25 октября 2025 года — это суббота.\n' +
        'Небольшие компании со среднесписочной численностью работников до 100 человек могут сдать декларацию на бумаге, остальным придется отчитаться в электронном формате (п. 3 ст. 80 НК РФ).\n' +
        'Порядок заполнения\n'
  }
]
const payData = [
  {
    number: '№015-45N',
    date: '15.06.2025',
    value: '110 567 ₽',
    status: 'Платёж просрочен',
  },
  {
    number: '№015-45N',
    date: '15.06.2025',
    value: '110 567 ₽',
    status: 'Ожидает оплаты',
  },
  {
    number: '№015-45N',
    date: '15.06.2025',
    value: '110 567 ₽',
    status: 'Ожидает оплаты',
  },
  {
    number: '№015-45N',
    date: '15.06.2025',
    value: '110 567 ₽',
    status: 'Платёж просрочен',
  },
  {
    number: '№015-45N',
    date: '15.06.2025',
    value: '110 567 ₽',
    status: 'Ожидает оплаты',
  }
]
const onSwiper = (instance) => {
  swiper.value = instance;
};
</script>

<template>
  <div class="lk">


    <article class="bills-block lk-block">
      <p class="bills-block__title bold-xxl">Ваши счета</p>
      <div class="bills-block__value-block">
        <p class="bills-block__description medium-l">Доступно на ваших счетах</p>
        <p class="bills-block__value medium-value">1 000 000, 00 ₽ </p>
        <div class="bills-block__download regular-s"><p>Выписка по счету</p>
          <IconDownload/>
        </div>
      </div>
      <Swiper
          :slidesPerView="'auto'"
          :space-between="16"
          class="lk-slider__swiper"
          @swiper="onSwiper">
        <SwiperSlide v-for="(item, idx) in billsData" :key="idx" class="lk-slider__slide">
          <LkBills :all="idx === 0" :title="item.title" :value="item.value"/>
        </SwiperSlide>
      </Swiper>
    </article>
    <article class="tax-block lk-block">
      <p class="tax-block__title bold-xxl">Налоговые обновления</p>
      <div class="tax-block__taxes">
        <LkTax v-for="(tax, idx) in taxData" :key="idx" :title="tax.title" :description="tax.description"/>
      </div>
    </article>
    <article class="pay-block lk-block">
      <p class="pay-block bold-xxl">Счета на оплату</p>
      <div class="pay-block__pays">
        <LkPay v-for="(pay, idx) in payData"
               :key="idx"
               :date="pay.date"
               :number="pay.number"
               :value="pay.value"
               :status="pay.status"/>
      </div>
    </article>
  </div>
</template>

<style lang="sass">
@use "/const/color"
.lk
  display: grid
  gap: 25px
  grid-template-areas: 'bills pay' 'tax pay'
  justify-content: center

.bills-block
  grid-area: bills

.tax-block
  grid-area: tax

.pay-block
  grid-area: pay

.lk-slider__slide
  width: fit-content

.lk-slider__swiper
  width: 100%

.lk-block
  box-sizing: border-box
  width: 679px
  height: fit-content
  border-radius: 16px
  padding: 20px
  gap: 30px
  display: flex
  flex-direction: column
  box-shadow: color.$shadow

.bills-block__description
  color: color.$gray

.bills-block__value-block
  display: flex
  flex-direction: column
  gap: 10px

.bills-block__download
  color: color.$gray
  display: flex
  flex-direction: row
  gap: 7px
  padding: 4px 10px
  border-radius: 6px
  background: color.$light-gray-2
  align-items: center
  width: fit-content

.tax-block__taxes
  display: grid
  grid-template-columns: 1fr 1fr
  gap: 30px 20px

.pay-block
  background: color.$bg-gray
  width: fit-content

.pay-block__pays
  display: flex
  flex-direction: column
  gap: 10px
</style>